
  ___  ____  ____  ____  ____ ©
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501706328764
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do code/create.do 

. here
/Users/koren/Tresorit/places/restud/data-editor/report/

. local here = r(here)

. 
. import delimited using "`here'/trello_json/table31aug21.csv", clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 4,379 obs)

. rename list_before from_list

. rename list_after to_list

. 
. * read MS number
. generate ms_number = real(ustrregexs(0)) if ustrregexm(name, "([0-9]){5}") 
(116 missing values generated)

. 
. * convert date string to datetime
. generate double timestamp = date(date, "YMD#")
(2,831 missing values generated)

. format timestamp %tdCCYY-NN-DD

. 
. * keep list moves and first action only
. keep if action_id == 0 | !missing(from_list, to_list)
(3,444 observations deleted)

. egen byte ever_accepted = max(to_list == "Editor accepted"), by(ms_number)

. 
. * group actions
. egen action_number = rank(action_id), by(ms_number) unique

. xtset ms_number action_number

Panel variable: ms_number (unbalanced)
 Time variable: action_number, 1 to 19
         Delta: 1 unit

. * time spent in "from" list before moving it to "to" list
. * FIXME: some cards are created in "Author submitted", some are moved there. 
> The former will have . for duration
. generate duration = datediff(L.timestamp, timestamp, "day")
(147 missing values generated)

. * round #: how many times have the card moved out from "Author submitted"?
. bysort ms_number (action_number): generate round_number = sum((from_list == "
> Author submitted"))

. tabulate round_number, missing

round_numbe |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        207       22.14       22.14
          1 |        335       35.83       57.97
          2 |        250       26.74       84.71
          3 |        112       11.98       96.68
          4 |         24        2.57       99.25
          5 |          4        0.43       99.68
          6 |          3        0.32      100.00
------------+-----------------------------------
      Total |        935      100.00

. * FIXME: move to analyze.do
. tabulate round_number if to_list == "Editor accepted"

round_numbe |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          2        3.08        3.08
          2 |         32       49.23       52.31
          3 |         24       36.92       89.23
          4 |          6        9.23       98.46
          6 |          1        1.54      100.00
------------+-----------------------------------
      Total |         65      100.00

. 
. generate byte at_editor = 1 if inlist(from_list, "Author submitted", "At team
> ", "At editor", "WIP", "Revised")
(329 missing values generated)

. replace at_editor = 0 if inlist(from_list, "At author")
(126 real changes made)

. tabulate at_editor, missing

  at_editor |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        126       13.48       13.48
          1 |        606       64.81       78.29
          . |        203       21.71      100.00
------------+-----------------------------------
      Total |        935      100.00

. 
. * merge different lists at editor
. drop if round_number == 0 | missing(at_editor)
(220 observations deleted)

. replace round_number = 3 if round_number > 3
(31 real changes made)

. collapse (sum) duration, by(ms_number ever_accepted round_number at_editor)

. reshape wide duration, i(ms_number round_number) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations              333   ->   217         
Number of variables                   5   ->   5           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                               duration   ->   duration0 duration1
-----------------------------------------------------------------------------

. reshape long
(j = 0 1)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations              217   ->   434         
Number of variables                   5   ->   5           
j variable (2 values)                     ->   at_editor
xij variables:
                    duration0 duration1   ->   duration
-----------------------------------------------------------------------------

. mvencode duration, mv(0) override
    duration: 101 missing values recoded

. 
. table round_number at_editor if ever_accepted

---------------------------------
             |      at_editor    
             |    0     1   Total
-------------+-------------------
round_number |                   
  1          |   62    62     124
  2          |   60    60     120
  3          |   31    31      62
  Total      |  153   153     306
---------------------------------

. table round_number at_editor if ever_accepted, statistic(mean duration)

----------------------------------------------
             |             at_editor          
             |         0          1      Total
-------------+--------------------------------
round_number |                                
  1          |  11.75806   11.77419   11.76613
  2          |  4.566667   8.483333      6.525
  3          |  1.354839    8.83871   5.096774
  Total      |  6.830065   9.888889   8.359477
----------------------------------------------

. save "`here'/data/durations.dta", replace
file
    /Users/koren/Tresorit/places/restud/data-editor/report//data/durations.dt
    > a saved

. 
. collapse (sum) duration, by(ms_number ever_accepted at_editor)

. table at_editor if ever_accepted, statistic(mean duration)

---------------------
          |      Mean
----------+----------
at_editor |          
  0       |  16.85484
  1       |  24.40323
  Total   |  20.62903
---------------------

. 
end of do-file
