
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/durations.do 

. clear all

. here
/Users/koren/Tresorit/Mac/places/restud/data-editor/report/

. local here = r(here)

. 
. use "`here'data/git-events.dta", clear

. 
. bysort MS (numeric_date branch tag): generate t = _n

. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 27
         Delta: 1 unit

. 
. generate spell = D.numeric_date
(290 missing values generated)

. bysort MS (t): generate byte at_editor = (branch[_n-1] == branch[_n] ) | (bra
> nch[_n-1] == "author")

. 
. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 27
         Delta: 1 unit

. generate byte change = L.at_editor != at_editor

. bysort MS (t): generate byte spell_id = sum(change)

. 
. * count of packages in pipeline
. egen last_commit = max(cond(substr(tag, 1, 6) == "accept", t, .)), by(MS)

. * drop updates after acceptance
. keep if t <= last_commit
(75 observations deleted)

. 
. codebook MS

-------------------------------------------------------------------------------
MS                                                                  (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [17262,34171]                 Units: 1
         Unique values: 290                       Missing .: 0/2,073

                  Mean: 28717.6
             Std. dev.: 2383.72

           Percentiles:     10%       25%       50%       75%       90%
                          25731     27122     28862     30349     31976

. save "`here'temp/git-events-processed.dta", replace
(file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/temp/git-event
    > s-processed.dta not found)
file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/temp/git-event
    > s-processed.dta saved

. 
. rename accepted_year year

. preserve

.     collapse (sum) spell, by(MS year spell_id at_editor)

.     drop if spell_id == 1
(290 observations deleted)

.     replace spell_id = int((spell_id - 1)/2)
(969 real changes made)

. 
.     reshape wide spell, i(MS spell_id year) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations              969   ->   642         
Number of variables                   5   ->   5           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                                  spell   ->   spell0 spell1
-----------------------------------------------------------------------------

.     rename spell_id revision

.     rename spell0 time_at_author

.     rename spell1 time_at_editor

. 
.     egen max_revision = max(revision), by(MS)

.     save "`here'temp/collapsed_year.dta", replace
(file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/temp/collapsed
    > _year.dta not found)
file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/temp/collapsed
    > _year.dta saved

. restore

. keep if year == 2024
(1,410 observations deleted)

. 
. collapse (sum) spell, by(MS accepted_at spell_id at_editor)

. drop if spell_id == 1
(90 observations deleted)

. replace spell_id = int((spell_id - 1)/2)
(289 real changes made)

. 
. reshape wide spell, i(MS spell_id) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations              289   ->   190         
Number of variables                   5   ->   5           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                                  spell   ->   spell0 spell1
-----------------------------------------------------------------------------

. rename spell_id revision

. rename spell0 time_at_author

. rename spell1 time_at_editor

. 
. egen max_revision = max(revision), by(MS)

. save "`here'temp/collapsed_accepted_at.dta", replace
(file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/temp/collapsed
    > _accepted_at.dta not found)
file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/temp/collapsed
    > _accepted_at.dta saved

. 
. 
. local opt width(7) start(0) frequency graphregion(color(white))

. 
. summarize time_at_editor if revision==0, detail

                           1 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            3              0       Obs                  90
25%           16              0       Sum of wgt.          90

50%           25                      Mean           23.85556
                        Largest       Std. dev.      15.00379
75%           29             55
90%         36.5             57       Variance       225.1137
95%           48             66       Skewness       1.313189
99%           95             95       Kurtosis       7.901081

. summarize time_at_editor if revision>=1, detail

                           1 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  99
25%            0              0       Sum of wgt.          99

50%            0                      Mean           8.212121
                        Largest       Std. dev.      16.03839
75%            5             52
90%           37             56       Variance       257.2301
95%           47             56       Skewness       1.877763
99%           62             62       Kurtosis       5.169163

. summarize time_at_author, detail

                           0 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%           .5              0
 5%          4.5              1
10%            5              4       Obs                 100
25%          8.5              4       Sum of wgt.         100

50%           16                      Mean              28.79
                        Largest       Std. dev.      36.52239
75%         31.5            145
90%           74            161       Variance       1333.885
95%          113            184       Skewness       2.677197
99%          184            184       Kurtosis       10.33706

. twoway (histogram time_at_editor if revision==0, `opt' color(blue%30)) (histo
> gram time_at_editor if revision>=1, `opt' color(red%30)), xtitle(Days at edit
> or) legend(order(1 "First submission" 2 "Revision"))

. graph export "`here'output/time_at_editor.png", replace width(800)
(file /Users/koren/Tresorit/Mac/places/restud/data-editor/report/output/time_at
> _editor.png not found)
file /Users/koren/Tresorit/Mac/places/restud/data-editor/report/output/time_at_
> editor.png written in PNG format

. 
. tabulate max_revision if revision == 0

max_revisio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         13       14.44       14.44
          1 |         57       63.33       77.78
          2 |         17       18.89       96.67
          3 |          3        3.33      100.00
------------+-----------------------------------
      Total |         90      100.00

. histogram max_revision if revision == 0, color(blue%30) discrete start(0) fre
> quency xtitle(Accepted revision) graphregion(color(white))
(start=0, width=1)

. graph export "`here'output/revision.png", replace width(800)
(file /Users/koren/Tresorit/Mac/places/restud/data-editor/report/output/revisio
> n.png not found)
file /Users/koren/Tresorit/Mac/places/restud/data-editor/report/output/revision
> .png written in PNG format

. 
end of do-file
