
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/durations.do 

. clear all

. here
/Users/koren/Tresorit/Mac/places/restud/data-editor/report/

. local here = r(here)

. 
. use "`here'data/git-events.dta", clear

. 
. bysort MS (numeric_date branch tag): generate t = _n

. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 27
         Delta: 1 unit

. 
. generate spell = D.numeric_date
(384 missing values generated)

. * FIXME COULD USE COMMIT MESSAGE TO FLAG
. bysort MS (t): generate byte at_editor = (branch[_n-1] == branch[_n] ) | (bra
> nch[_n-1] == "author")

. 
. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 27
         Delta: 1 unit

. generate byte change = L.at_editor != at_editor

. bysort MS (t): generate byte spell_id = sum(change)

. 
. * count of packages in pipeline
. egen last_commit = max(cond(substr(tag, 1, 6) == "accept", t, .)), by(MS)
(13 missing values generated)

. * drop updates after acceptance
. * FIXME THIS SHOULD BE BY TIMESTAMP NOT INDEX
. keep if t <= last_commit
(24 observations deleted)

. 
. codebook MS

-------------------------------------------------------------------------------
MS                                                                  (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [17262,35540]                 Units: 1
         Unique values: 384                       Missing .: 0/2,797

                  Mean: 29265.2
             Std. dev.: 2742.39

           Percentiles:     10%       25%       50%       75%       90%
                          25834     27512     29315     31175     32766

. save "`here'temp/git-events-processed.dta", replace
file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/temp/git-event
    > s-processed.dta saved

. 
. rename accepted_year year

. preserve

.     collapse (sum) spell, by(MS year spell_id at_editor)

.     drop if spell_id == 1
(384 observations deleted)

.     replace spell_id = int((spell_id - 1)/2)
(1,270 real changes made)

. 
.     reshape wide spell, i(MS spell_id year) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations            1,270   ->   836         
Number of variables                   5   ->   5           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                                  spell   ->   spell0 spell1
-----------------------------------------------------------------------------

.     rename spell_id revision

.     * FIXME NO, revision comes from branch name
.     rename spell0 time_at_author

.     rename spell1 time_at_editor

. 
.     egen max_revision = max(revision), by(MS)

.     save "`here'temp/collapsed_year.dta", replace
file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/temp/collapsed
    > _year.dta saved

. restore

. keep if year == 2025
(2,182 observations deleted)

. 
. collapse (sum) spell, by(MS accepted_at spell_id at_editor)

. drop if spell_id == 1
(84 observations deleted)

. replace spell_id = int((spell_id - 1)/2)
(252 real changes made)

. 
. reshape wide spell, i(MS spell_id) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations              252   ->   168         
Number of variables                   5   ->   5           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                                  spell   ->   spell0 spell1
-----------------------------------------------------------------------------

. rename spell_id revision

. rename spell0 time_at_author

. rename spell1 time_at_editor

. 
. egen max_revision = max(revision), by(MS)

. save "`here'temp/collapsed_accepted_at.dta", replace
file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/temp/collapsed
    > _accepted_at.dta saved

. 
. 
. local opt width(7) start(0) frequency graphregion(color(white))

. 
. summarize time_at_editor if revision==0, detail

                           1 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  84
25%           16              0       Sum of wgt.          84

50%         24.5                      Mean           33.15476
                        Largest       Std. dev.       27.9192
75%           48            102
90%           65            102       Variance       779.4818
95%           91            119       Skewness       1.396223
99%          138            138       Kurtosis       5.363357

. summarize time_at_editor if revision>=1, detail

                           1 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  84
25%            0              0       Sum of wgt.          84

50%            2                      Mean           12.19048
                        Largest       Std. dev.      17.83085
75%         17.5             58
90%           35             62       Variance       317.9392
95%           58             67       Skewness        1.67726
99%           69             69       Kurtosis       5.001621

. summarize time_at_author, detail

                           0 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              1
10%            5              2       Obs                  84
25%            7              3       Sum of wgt.          84

50%           19                      Mean           27.09524
                        Largest       Std. dev.      33.51986
75%         30.5            110
90%           56            125       Variance       1123.581
95%          103            127       Skewness       3.261705
99%          221            221       Kurtosis       16.41904

. twoway (histogram time_at_editor if revision==0, `opt' color(blue%30)) (histo
> gram time_at_editor if revision>=1, `opt' color(red%30)), xtitle(Days at edit
> or) legend(order(1 "First submission" 2 "Revision"))

. graph export "`here'output/time_at_editor.png", replace width(800)
file /Users/koren/Tresorit/Mac/places/restud/data-editor/report/output/time_at_
> editor.png written in PNG format

. 
. tabulate max_revision if revision == 0

max_revisio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         19       22.62       22.62
          1 |         50       59.52       82.14
          2 |         12       14.29       96.43
          3 |          2        2.38       98.81
          4 |          1        1.19      100.00
------------+-----------------------------------
      Total |         84      100.00

. histogram max_revision if revision == 0, color(blue%30) discrete start(0) fre
> quency xtitle(Accepted revision) graphregion(color(white))
(start=0, width=1)

. graph export "`here'output/revision.png", replace width(800)
file /Users/koren/Tresorit/Mac/places/restud/data-editor/report/output/revision
> .png written in PNG format

. 
end of do-file
