
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/durations.do 

. clear all

. here
/Users/koren/Tresorit/Mac/places/restud/data-editor/report/

. local here = r(here)

. 
. use "`here'data/git-events.dta", clear

. 
. bysort MS (numeric_date): generate t = _n

. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 27
         Delta: 1 unit

. 
. generate spell = D.numeric_date
(290 missing values generated)

. bysort MS (t): generate byte at_editor = (branch[_n-1] == branch[_n] ) | (bra
> nch[_n-1] == "author")

. 
. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 27
         Delta: 1 unit

. generate byte change = L.at_editor != at_editor

. bysort MS (t): generate byte spell_id = sum(change)

. 
. * count of packages in pipeline
. egen last_commit = max(t), by(MS)

. 
. codebook MS

-------------------------------------------------------------------------------
MS                                                                  (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [17262,34171]                 Units: 1
         Unique values: 290                       Missing .: 0/2,148

                  Mean: 28692.9
             Std. dev.: 2377.38

           Percentiles:     10%       25%       50%       75%       90%
                          25731     27104     28784   30340.5     31924

. save "`here'temp/git-events-processed.dta", replace
file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/temp/git-event
    > s-processed.dta saved

. 
. rename accepted_year year

. preserve

.     collapse (sum) spell, by(MS year spell_id at_editor)

.     drop if spell_id == 1
(290 observations deleted)

.     replace spell_id = int((spell_id - 1)/2)
(1,016 real changes made)

. 
.     reshape wide spell, i(MS spell_id year) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations            1,016   ->   698         
Number of variables                   5   ->   5           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                                  spell   ->   spell0 spell1
-----------------------------------------------------------------------------

.     rename spell_id revision

.     rename spell0 time_at_author

.     rename spell1 time_at_editor

. 
.     egen max_revision = max(revision), by(MS)

.     save "`here'temp/collapsed_year.dta", replace
file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/temp/collapsed
    > _year.dta saved

. restore

. 
. keep if year == 2024
(1,472 observations deleted)

. 
. collapse (sum) spell, by(MS accepted_at spell_id at_editor)

. drop if spell_id == 1
(90 observations deleted)

. replace spell_id = int((spell_id - 1)/2)
(294 real changes made)

. 
. reshape wide spell, i(MS spell_id) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations              294   ->   202         
Number of variables                   5   ->   5           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                                  spell   ->   spell0 spell1
-----------------------------------------------------------------------------

. rename spell_id revision

. rename spell0 time_at_author

. rename spell1 time_at_editor

. 
. egen max_revision = max(revision), by(MS)

. save "`here'temp/collapsed_accepted_at.dta", replace
file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/temp/collapsed
    > _accepted_at.dta saved

. 
. 
. local opt width(7) start(0) frequency graphregion(color(white))

. 
. summarize time_at_editor if revision==0, detail

                           1 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  88
25%         14.5              0       Sum of wgt.          88

50%           24                      Mean           22.48864
                        Largest       Std. dev.      16.07525
75%           29             55
90%           37             57       Variance       258.4137
95%           48             66       Skewness        1.15398
99%           95             95       Kurtosis       6.782126

. summarize time_at_editor if revision>=1, detail

                           1 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  92
25%            0              0       Sum of wgt.          92

50%            1                      Mean           12.97826
                        Largest       Std. dev.      18.39014
75%           29             56
90%           41             59       Variance       338.1973
95%           56             62       Skewness        1.26965
99%           67             67       Kurtosis       3.416388

. summarize time_at_author, detail

                           0 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 114
25%            6              0       Sum of wgt.         114

50%           14                      Mean           27.69298
                        Largest       Std. dev.      37.74346
75%           30            154
90%           74            161       Variance       1424.569
95%          125            184       Skewness       2.532916
99%          184            184       Kurtosis        9.40704

. twoway (histogram time_at_editor if revision==0, `opt' color(blue%30)) (histo
> gram time_at_editor if revision>=1, `opt' color(red%30)), xtitle(Days at edit
> or) legend(order(1 "First submission" 2 "Revision"))

. graph export "`here'output/time_at_editor.png", replace width(800)
file /Users/koren/Tresorit/Mac/places/restud/data-editor/report/output/time_at_
> editor.png written in PNG format

. 
. tabulate max_revision if revision == 0

max_revisio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         11       12.50       12.50
          1 |         48       54.55       67.05
          2 |         21       23.86       90.91
          3 |          8        9.09      100.00
------------+-----------------------------------
      Total |         88      100.00

. histogram max_revision if revision == 0, color(blue%30) discrete start(0) fre
> quency xtitle(Accepted revision) graphregion(color(white))
(start=0, width=1)

. graph export "`here'output/revision.png", replace width(800)
file /Users/koren/Tresorit/Mac/places/restud/data-editor/report/output/revision
> .png written in PNG format

. 
end of do-file
