
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 2-user 4-core network, expiring 16 Jan 2026
Serial number: 501909221790
  Licensed to: CodedThinking
               Budapest

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/durations.do 

. clear all

. here
/home/restud/report/

. local here = r(here)

. 
. use "`here'data/git-events.dta", clear

. 
. bysort MS (numeric_date branch tag): generate t = _n

. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 27
         Delta: 1 unit

. 
. generate spell = D.numeric_date
(247 missing values generated)

. bysort MS (t): generate byte at_editor = (branch[_n-1] == branch[_n] ) | (bra
> nch[_n-1] == "author")

. 
. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 27
         Delta: 1 unit

. generate byte change = L.at_editor != at_editor

. bysort MS (t): generate byte spell_id = sum(change)

. 
. * count of packages in pipeline
. egen last_commit = max(cond(substr(tag, 1, 6) == "accept", t, .)), by(MS)

. * drop updates after acceptance
. keep if t <= last_commit
(10 observations deleted)

. 
. codebook MS

-------------------------------------------------------------------------------
MS                                                                  (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [17262,34171]                 Units: 1
         Unique values: 247                       Missing .: 0/1,772

                  Mean: 28817.1
             Std. dev.: 2408.13

           Percentiles:     10%       25%       50%       75%       90%
                          25780     27173     29075     30633     31924

. save "`here'temp/git-events-processed.dta", replace
file /home/restud/report/temp/git-events-processed.dta saved

. 
. rename accepted_year year

. preserve

.     collapse (sum) spell, by(MS year spell_id at_editor)

.     drop if spell_id == 1
(247 observations deleted)

.     replace spell_id = int((spell_id - 1)/2)
(837 real changes made)

. 
.     reshape wide spell, i(MS spell_id year) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations              837   ->   548         
Number of variables                   5   ->   5           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                                  spell   ->   spell0 spell1
-----------------------------------------------------------------------------

.     rename spell_id revision

.     rename spell0 time_at_author

.     rename spell1 time_at_editor

. 
.     egen max_revision = max(revision), by(MS)

.     save "`here'temp/collapsed_year.dta", replace
file /home/restud/report/temp/collapsed_year.dta saved

. restore

. keep if year == 2024
(1,221 observations deleted)

. 
. collapse (sum) spell, by(MS accepted_at spell_id at_editor)

. drop if spell_id == 1
(73 observations deleted)

. replace spell_id = int((spell_id - 1)/2)
(242 real changes made)

. 
. reshape wide spell, i(MS spell_id) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations              242   ->   158         
Number of variables                   5   ->   5           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                                  spell   ->   spell0 spell1
-----------------------------------------------------------------------------

. rename spell_id revision

. rename spell0 time_at_author

. rename spell1 time_at_editor

. 
. egen max_revision = max(revision), by(MS)

. save "`here'temp/collapsed_accepted_at.dta", replace
file /home/restud/report/temp/collapsed_accepted_at.dta saved

. 
. 
. local opt width(7) start(0) frequency graphregion(color(white))

. 
. summarize time_at_editor if revision==0, detail

                           1 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs                  73
25%           15              0       Sum of wgt.          73

50%           24                      Mean           23.32877
                        Largest       Std. dev.      16.02433
75%           30             48
90%           36             57       Variance       256.7793
95%           48             66       Skewness       1.346597
99%           95             95       Kurtosis       7.501355

. summarize time_at_editor if revision>=1, detail

                           1 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  84
25%            0              0       Sum of wgt.          84

50%            0                      Mean           9.630952
                        Largest       Std. dev.      17.30713
75%            6             52
90%           37             56       Variance       299.5369
95%           47             56       Skewness       1.563094
99%           62             62       Kurtosis       3.989976

. summarize time_at_author, detail

                           0 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            5              4
10%            5              4       Obs                  85
25%            7              4       Sum of wgt.          85

50%           14                      Mean           25.44706
                        Largest       Std. dev.      33.63194
75%           28             92
90%           56            145       Variance       1131.107
95%           81            184       Skewness       3.215084
99%          184            184       Kurtosis       14.26799

. twoway (histogram time_at_editor if revision==0, `opt' color(blue%30)) (histo
> gram time_at_editor if revision>=1, `opt' color(red%30)), xtitle(Days at edit
> or) legend(order(1 "First submission" 2 "Revision"))

. graph export "`here'output/time_at_editor.png", replace width(800)
file /home/restud/report/output/time_at_editor.png written in PNG format

. 
. tabulate max_revision if revision == 0

max_revisio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         10       13.70       13.70
          1 |         44       60.27       73.97
          2 |         16       21.92       95.89
          3 |          3        4.11      100.00
------------+-----------------------------------
      Total |         73      100.00

. histogram max_revision if revision == 0, color(blue%30) discrete start(0) fre
> quency xtitle(Accepted revision) graphregion(color(white))
(start=0, width=1)

. graph export "`here'output/revision.png", replace width(800)
file /home/restud/report/output/revision.png written in PNG format

. 
end of do-file
