
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 2-user 4-core network, expiring 16 Jan 2026
Serial number: 501909221790
  Licensed to: CodedThinking
               Budapest

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/durations.do 

. clear all

. here
/home/restud/report/

. local here = r(here)

. 
. use "`here'data/git-events.dta", clear

. 
. drop if regexm(message, "Merge tag 'accepted' into")
(2 observations deleted)

. drop if regexm(message, "Create .zenodo")
(144 observations deleted)

. drop if MS == 26586 // Nunn that had to be revisited
(6 observations deleted)

. 
. bysort MS (numeric_date branch tag): generate t = _n

. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 27
         Delta: 1 unit

. 
. generate spell = D.numeric_date
(384 missing values generated)

. bysort MS (t): generate byte at_editor = (branch[_n-1] == branch[_n] ) | (bra
> nch[_n-1] == "author")

. 
. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 27
         Delta: 1 unit

. generate byte change = L.at_editor != at_editor

. bysort MS (t): generate byte spell_id = sum(change)

. 
. * count of packages in pipeline
. egen last_commit = max(cond(substr(tag, 1, 6) == "accept", t, .)), by(MS)
(13 missing values generated)

. * drop updates after acceptance
. keep if t <= last_commit
(20 observations deleted)

. 
. codebook MS

-------------------------------------------------------------------------------
MS                                                                  (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [17262,35540]                 Units: 1
         Unique values: 384                       Missing .: 0/2,827

                  Mean: 29246.3
             Std. dev.: 2739.21

           Percentiles:     10%       25%       50%       75%       90%
                          25834     27466     29304     31166     32766

. save "`here'temp/git-events-processed.dta", replace
file /home/restud/report/temp/git-events-processed.dta saved

. 
. rename accepted_year year

. preserve

.     collapse (sum) spell, by(MS year spell_id at_editor)

.     drop if spell_id == 1
(384 observations deleted)

.     replace spell_id = int((spell_id - 1)/2)
(1,275 real changes made)

. 
.     reshape wide spell, i(MS spell_id year) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations            1,275   ->   837         
Number of variables                   5   ->   5           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                                  spell   ->   spell0 spell1
-----------------------------------------------------------------------------

.     rename spell_id revision

.     rename spell0 time_at_author

.     rename spell1 time_at_editor

. 
.     egen max_revision = max(revision), by(MS)

.     save "`here'temp/collapsed_year.dta", replace
file /home/restud/report/temp/collapsed_year.dta saved

. restore

. keep if year == 2025
(1,772 observations deleted)

. 
. collapse (sum) spell, by(MS accepted_at spell_id at_editor)

. drop if spell_id == 1
(137 observations deleted)

. replace spell_id = int((spell_id - 1)/2)
(438 real changes made)

. 
. reshape wide spell, i(MS spell_id) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations              438   ->   289         
Number of variables                   5   ->   5           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                                  spell   ->   spell0 spell1
-----------------------------------------------------------------------------

. rename spell_id revision

. rename spell0 time_at_author

. rename spell1 time_at_editor

. 
. egen max_revision = max(revision), by(MS)

. save "`here'temp/collapsed_accepted_at.dta", replace
file /home/restud/report/temp/collapsed_accepted_at.dta saved

. 
. 
. local opt width(7) start(0) frequency graphregion(color(white))

. 
. summarize time_at_editor if revision==0, detail

                           1 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 137
25%           14              0       Sum of wgt.         137

50%           25                      Mean            41.9708
                        Largest       Std. dev.      98.69911
75%           37            138
90%           63            535       Variance       9741.514
95%          102            603       Skewness       6.396919
99%          603            855       Kurtosis       46.46909

. summarize time_at_editor if revision>=1, detail

                           1 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 149
25%            0              0       Sum of wgt.         149

50%            4                      Mean            146.604
                        Largest       Std. dev.      343.7814
75%           32           1222
90%          818           1258       Variance       118185.7
95%         1144           1260       Skewness       2.337687
99%         1260           1270       Kurtosis       6.932982

. summarize time_at_author, detail

                           0 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            3              0
10%            5              1       Obs                 152
25%            7              1       Sum of wgt.         152

50%         18.5                      Mean           32.29605
                        Largest       Std. dev.      60.37519
75%         29.5            161
90%           57            221       Variance       3645.163
95%          125            307       Skewness       6.156706
99%          307            586       Kurtosis       51.07918

. twoway (histogram time_at_editor if revision==0, `opt' color(blue%30)) (histo
> gram time_at_editor if revision>=1, `opt' color(red%30)), xtitle(Days at edit
> or) legend(order(1 "First submission" 2 "Revision"))

. graph export "`here'output/time_at_editor.png", replace width(800)
file /home/restud/report/output/time_at_editor.png written in PNG format

. 
. tabulate max_revision if revision == 0

max_revisio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         25       18.25       18.25
          1 |         80       58.39       76.64
          2 |         26       18.98       95.62
          3 |          4        2.92       98.54
          4 |          2        1.46      100.00
------------+-----------------------------------
      Total |        137      100.00

. histogram max_revision if revision == 0, color(blue%30) discrete start(0) fre
> quency xtitle(Accepted revision) graphregion(color(white))
(start=0, width=1)

. graph export "`here'output/revision.png", replace width(800)
file /home/restud/report/output/revision.png written in PNG format

. 
end of do-file
