
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501706328764
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do code/durations.do 

. clear all

. here
/Users/koren/Tresorit/places/restud/data-editor/report/

. local here = r(here)

. 
. use "`here'git_data/output/gitlog.dta", clear

. replace MS = "27827" if MS == "27827-1"
(20 real changes made)

. destring MS, force replace
MS: contains nonnumeric characters; replaced as int
(3 missing values generated)

. 
. * keep only packages with new branch naming
. keep if inlist(branch_imputed, "author", "version1", "version2", "version3", 
> "version4")
(301 observations deleted)

. egen byte ever_accepted = max(tag=="accepted"), by(MS)

. 
. * keep backages accepted in 2021 fiscal year
. egen accepted_at = max(cond(tag=="accepted", numeric_date, .)), by(MS)
(214 missing values generated)

. scalar dbegin = 1630495609 - 13.4*3600

. scalar dend = dbegin + 365 * 24 * 3600

. 
. bysort MS (numeric_date): generate t = _n

. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 27
         Delta: 1 unit

. 
. generate spell = D.numeric_date/3600/24
(146 missing values generated)

. bysort MS (t): generate byte at_editor = (branch_imputed[_n-1] == branch_impu
> ted[_n] ) | (branch_imputed[_n-1] == "author")

. 
. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 27
         Delta: 1 unit

. generate byte change = L.at_editor != at_editor

. bysort MS (t): generate byte spell_id = sum(change)

. 
. collapse (sum) spell, by(MS ever_accepted accepted_at spell_id at_editor)

. drop if spell_id == 1
(146 observations deleted)

. replace spell_id = int((spell_id - 1)/2)
(496 real changes made)

. 
. reshape wide spell, i(MS spell_id) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations              496   ->   327         
Number of variables                   6   ->   6           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                                  spell   ->   spell0 spell1
-----------------------------------------------------------------------------

. rename spell_id revision

. rename spell0 time_at_author

. rename spell1 time_at_editor

. 
. egen max_revision = max(revision), by(MS)

. 
. local filter ever_accepted & (accepted_at > dbegin) * (accepted_at <= dend)

. local opt width(7) start(0) frequency

. twoway (histogram time_at_editor if `filter' & revision==0, `opt' color(blue%
> 30)) (histogram time_at_editor if `filter' & revision>=1, `opt' color(red%30)
> ), xtitle(Days at editor) legend(order(1 "First submission" 2 "Revision"))

. graph export "`here'time_at_editor.png", replace width(800)
file /Users/koren/Tresorit/places/restud/data-editor/report/time_at_editor.png 
> written in PNG format

. 
. histogram max_revision if `filter' & revision == 0, color(blue%30) discrete s
> tart(0) frequency xtitle(Accepted revision)
(start=0, width=1)

. graph export "`here'revision.png", replace width(800)
file /Users/koren/Tresorit/places/restud/data-editor/report/revision.png writte
> n in PNG format

. 
end of do-file
