
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 2-user 4-core network, expiring 16 Jan 2026
Serial number: 501909221790
  Licensed to: CodedThinking
               Budapest

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/durations.do 

. clear all

. here
/home/restud/report/

. local here = r(here)

. 
. use "`here'data/git-events.dta", clear

. 
. bysort MS (numeric_date branch tag): generate t = _n

. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 28
         Delta: 1 unit

. 
. generate spell = D.numeric_date
(385 missing values generated)

. bysort MS (t): generate byte at_editor = (branch[_n-1] == branch[_n] ) | (bra
> nch[_n-1] == "author")

. 
. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 28
         Delta: 1 unit

. generate byte change = L.at_editor != at_editor

. bysort MS (t): generate byte spell_id = sum(change)

. 
. * count of packages in pipeline
. egen last_commit = max(cond(substr(tag, 1, 6) == "accept", t, .)), by(MS)

. * drop updates after acceptance
. keep if t <= last_commit
(16 observations deleted)

. 
. codebook MS

-------------------------------------------------------------------------------
MS                                                                  (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [17262,35540]                 Units: 1
         Unique values: 385                       Missing .: 0/2,983

                  Mean: 29200.9
             Std. dev.: 2728.91

           Percentiles:     10%       25%       50%       75%       90%
                          25834     27364     29293     31149     32650

. save "`here'temp/git-events-processed.dta", replace
file /home/restud/report/temp/git-events-processed.dta saved

. 
. rename accepted_year year

. preserve

.     collapse (sum) spell, by(MS year spell_id at_editor)

.     drop if spell_id == 1
(385 observations deleted)

.     replace spell_id = int((spell_id - 1)/2)
(1,424 real changes made)

. 
.     reshape wide spell, i(MS spell_id year) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations            1,424   ->   933         
Number of variables                   5   ->   5           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                                  spell   ->   spell0 spell1
-----------------------------------------------------------------------------

.     rename spell_id revision

.     rename spell0 time_at_author

.     rename spell1 time_at_editor

. 
.     egen max_revision = max(revision), by(MS)

.     save "`here'temp/collapsed_year.dta", replace
file /home/restud/report/temp/collapsed_year.dta saved

. restore

. keep if year == 2025
(1,772 observations deleted)

. 
. collapse (sum) spell, by(MS accepted_at spell_id at_editor)

. drop if spell_id == 1
(138 observations deleted)

. replace spell_id = int((spell_id - 1)/2)
(587 real changes made)

. 
. reshape wide spell, i(MS spell_id) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations              587   ->   385         
Number of variables                   5   ->   5           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                                  spell   ->   spell0 spell1
-----------------------------------------------------------------------------

. rename spell_id revision

. rename spell0 time_at_author

. rename spell1 time_at_editor

. 
. egen max_revision = max(revision), by(MS)

. save "`here'temp/collapsed_accepted_at.dta", replace
file /home/restud/report/temp/collapsed_accepted_at.dta saved

. 
. 
. local opt width(7) start(0) frequency graphregion(color(white))

. 
. summarize time_at_editor if revision==0, detail

                           1 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 138
25%           12              0       Sum of wgt.         138

50%         24.5                      Mean           30.01449
                        Largest       Std. dev.      32.08224
75%           37            102
90%           63            119       Variance        1029.27
95%           91            138       Skewness       3.726464
99%          138            271       Kurtosis       25.59255

. summarize time_at_editor if revision>=1, detail

                           1 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 202
25%            0              0       Sum of wgt.         202

50%            0                      Mean            33.0495
                        Largest       Std. dev.      171.2281
75%           11            831
90%           35           1074       Variance       29319.06
95%           64           1434       Skewness        7.11315
99%         1074           1436       Kurtosis       54.15423

. summarize time_at_author, detail

                           0 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 247
25%            5              0       Sum of wgt.         247

50%           19                      Mean           139.8259
                        Largest       Std. dev.      293.3653
75%           74           1258
90%          488           1260       Variance       86063.19
95%          931           1270       Skewness       2.666903
99%         1260           1348       Kurtosis       9.354175

. twoway (histogram time_at_editor if revision==0, `opt' color(blue%30)) (histo
> gram time_at_editor if revision>=1, `opt' color(red%30)), xtitle(Days at edit
> or) legend(order(1 "First submission" 2 "Revision"))

. graph export "`here'output/time_at_editor.png", replace width(800)
file /home/restud/report/output/time_at_editor.png written in PNG format

. 
. tabulate max_revision if revision == 0

max_revisio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         20       14.49       14.49
          1 |         55       39.86       54.35
          2 |         14       10.14       64.49
          3 |         35       25.36       89.86
          4 |         12        8.70       98.55
          5 |          1        0.72       99.28
          6 |          1        0.72      100.00
------------+-----------------------------------
      Total |        138      100.00

. histogram max_revision if revision == 0, color(blue%30) discrete start(0) fre
> quency xtitle(Accepted revision) graphregion(color(white))
(start=0, width=1)

. graph export "`here'output/revision.png", replace width(800)
file /home/restud/report/output/revision.png written in PNG format

. 
end of do-file
