
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 2-user 4-core network, expiring 16 Jan 2026
Serial number: 501909221790
  Licensed to: CodedThinking
               Budapest

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/durations.do 

. clear all

. here
/home/restud/report/

. local here = r(here)

. 
. use "`here'data/git-events.dta", clear

. 
. bysort MS (numeric_date branch tag): generate t = _n

. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 27
         Delta: 1 unit

. 
. generate spell = D.numeric_date
(383 missing values generated)

. bysort MS (t): generate byte at_editor = (branch[_n-1] == branch[_n] ) | (bra
> nch[_n-1] == "author")

. 
. xtset MS t

Panel variable: MS (unbalanced)
 Time variable: t, 1 to 27
         Delta: 1 unit

. generate byte change = L.at_editor != at_editor

. bysort MS (t): generate byte spell_id = sum(change)

. 
. * count of packages in pipeline
. egen last_commit = max(cond(substr(tag, 1, 6) == "accept", t, .)), by(MS)
(13 missing values generated)

. * drop updates after acceptance
. keep if t <= last_commit
(24 observations deleted)

. 
. codebook MS

-------------------------------------------------------------------------------
MS                                                                  (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [17262,35540]                 Units: 1
         Unique values: 383                       Missing .: 0/2,793

                  Mean: 29272.1
             Std. dev.: 2738.36

           Percentiles:     10%       25%       50%       75%       90%
                          25834     27512     29315     31175     32766

. save "`here'temp/git-events-processed.dta", replace
file /home/restud/report/temp/git-events-processed.dta saved

. 
. rename accepted_year year

. preserve

.     collapse (sum) spell, by(MS year spell_id at_editor)

.     drop if spell_id == 1
(383 observations deleted)

.     replace spell_id = int((spell_id - 1)/2)
(1,269 real changes made)

. 
.     reshape wide spell, i(MS spell_id year) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations            1,269   ->   835         
Number of variables                   5   ->   5           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                                  spell   ->   spell0 spell1
-----------------------------------------------------------------------------

.     rename spell_id revision

.     rename spell0 time_at_author

.     rename spell1 time_at_editor

. 
.     egen max_revision = max(revision), by(MS)

.     save "`here'temp/collapsed_year.dta", replace
file /home/restud/report/temp/collapsed_year.dta saved

. restore

. keep if year == 2025
(1,772 observations deleted)

. 
. collapse (sum) spell, by(MS accepted_at spell_id at_editor)

. drop if spell_id == 1
(136 observations deleted)

. replace spell_id = int((spell_id - 1)/2)
(432 real changes made)

. 
. reshape wide spell, i(MS spell_id) j(at_editor)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations              432   ->   287         
Number of variables                   5   ->   5           
j variable (2 values)         at_editor   ->   (dropped)
xij variables:
                                  spell   ->   spell0 spell1
-----------------------------------------------------------------------------

. rename spell_id revision

. rename spell0 time_at_author

. rename spell1 time_at_editor

. 
. egen max_revision = max(revision), by(MS)

. save "`here'temp/collapsed_accepted_at.dta", replace
file /home/restud/report/temp/collapsed_accepted_at.dta saved

. 
. 
. local opt width(7) start(0) frequency graphregion(color(white))

. 
. summarize time_at_editor if revision==0, detail

                           1 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 136
25%           12              0       Sum of wgt.         136

50%           24                      Mean           28.08824
                        Largest       Std. dev.      24.64428
75%         36.5            102
90%           56            102       Variance       607.3403
95%           70            119       Skewness       1.623094
99%          119            138       Kurtosis       6.839569

. summarize time_at_editor if revision>=1, detail

                           1 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 145
25%            0              0       Sum of wgt.         145

50%            1                      Mean           10.17931
                        Largest       Std. dev.      16.92207
75%           14             66
90%           34             67       Variance       286.3565
95%           53             69       Skewness       2.016445
99%           69             70       Kurtosis       6.408464

. summarize time_at_author, detail

                           0 spell
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            3              0
10%            5              1       Obs                 151
25%            7              1       Sum of wgt.         151

50%           18                      Mean           28.62914
                        Largest       Std. dev.      40.14982
75%           29            154
90%           57            161       Variance       1612.008
95%          110            221       Skewness       3.806507
99%          221            307       Kurtosis       21.52338

. twoway (histogram time_at_editor if revision==0, `opt' color(blue%30)) (histo
> gram time_at_editor if revision>=1, `opt' color(red%30)), xtitle(Days at edit
> or) legend(order(1 "First submission" 2 "Revision"))

. graph export "`here'output/time_at_editor.png", replace width(800)
file /home/restud/report/output/time_at_editor.png written in PNG format

. 
. tabulate max_revision if revision == 0

max_revisio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         24       17.65       17.65
          1 |         81       59.56       77.21
          2 |         25       18.38       95.59
          3 |          4        2.94       98.53
          4 |          2        1.47      100.00
------------+-----------------------------------
      Total |        136      100.00

. histogram max_revision if revision == 0, color(blue%30) discrete start(0) fre
> quency xtitle(Accepted revision) graphregion(color(white))
(start=0, width=1)

. graph export "`here'output/revision.png", replace width(800)
file /home/restud/report/output/revision.png written in PNG format

. 
end of do-file
