
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 2-user 4-core network, expiring 16 Jan 2026
Serial number: 501909221790
  Licensed to: CodedThinking
               Budapest

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/github.do 

. clear all

. here
/home/restud/report/

. local here = r(here)

. 
. import delimited "`here'/github-data/data/raw/gitlog.csv", clear varn(1) case
> (preserve)
(encoding automatically selected: UTF-8)
Note: Unmatched quote while processing row 572; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 574; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 626; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 628; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 652; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 654; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 687; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 689; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 721; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 723; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 866; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 868; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 883; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 885; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1074; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1076; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1259; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1261; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1374; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1376; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1388; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1390; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1426; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1428; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1489; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1491; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1509; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1511; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1533; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1535; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1575; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1577; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1697; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1699; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1776; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1778; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1900; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1902; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1970; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1972; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1979; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1981; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1984; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1986; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2099; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2101; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2117; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2119; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2127; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2129; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2307; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2309; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3002; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3004; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3005; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3007; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3012; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3014; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3346; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3356; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3357; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3373; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
(7 vars, 3,729 obs)

. replace MS = "27827" if MS == "27827-1"
(24 real changes made)

. destring MS, force replace
MS: contains nonnumeric characters; replaced as long
(51 missing values generated)

. 
. * Julia datetime is in timestamps with seconds (2019-12-10T17:28:33Z)
. replace date = substr(date, 1, 10)
(3,681 real changes made)

. gen numeric_date = date(date, "YMD")
(48 missing values generated)

. scalar fy2021 = date("2020-09-01", "YMD")

. scalar fy2022 = fy2021 + 365

. scalar fy2023 = fy2022 + 365

. scalar fy2024 = fy2023 + 365

. * 2024 is a leap year   
. scalar fy2025 = fy2024 + 366

. scalar fy2026 = fy2025 + 365

. 
. * keep only packages with new branch naming
. keep if inlist(branch, "author", "version1", "version2", "version3", "version
> 4")
(365 observations deleted)

. egen byte ever_accepted = max(tag=="accepted" | tag == "accept"), by(MS)

. 
. * keep backages accepted in 2021 fiscal year
. egen submitted_at = min(numeric_date), by(MS)

. egen accepted_at = max(cond(tag=="accepted" | tag == "accept", numeric_date, 
> .)), by(MS)
(365 missing values generated)

. scalar dbegin = fy2021

. * 2024 is a leap year
. scalar dend = fy2025

. 
. generate submitted_year = .
(3,364 missing values generated)

. generate accepted_year = .
(3,364 missing values generated)

. 
. forvalues fy = 2021/2025 {
  2.         local begindate = fy`fy'
  3.         local enddate = fy`=`fy'+1' -1
  4.     replace submitted_year = `fy' if inrange(submitted_at, `begindate', `e
> nddate') & submitted_year == .
  5.     replace accepted_year = `fy' if inrange(accepted_at, `begindate', `end
> date') & accepted_year == .
  6. }
(563 real changes made)
(186 real changes made)
(739 real changes made)
(559 real changes made)
(555 real changes made)
(478 real changes made)
(803 real changes made)
(559 real changes made)
(681 real changes made)
(1,217 real changes made)

. 
. egen ms_tag = tag(MS)

. tabulate submitted_year if ms_tag == 1

submitted_y |
        ear |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |         56       12.93       12.93
       2022 |         87       20.09       33.03
       2023 |         91       21.02       54.04
       2024 |         98       22.63       76.67
       2025 |        101       23.33      100.00
------------+-----------------------------------
      Total |        433      100.00

. tabulate accepted_year if ms_tag == 1

accepted_ye |
         ar |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |         23        5.97        5.97
       2022 |         68       17.66       23.64
       2023 |         83       21.56       45.19
       2024 |         73       18.96       64.16
       2025 |        138       35.84      100.00
------------+-----------------------------------
      Total |        385      100.00

. 
. keep if ever_accepted & (accepted_at > dbegin) * (accepted_at <= dend)
(1,582 observations deleted)

. save "`here'/data/git-events.dta", replace
file /home/restud/report//data/git-events.dta saved

. 
. import delimited "`here'github-data/data/temp/issues.csv", clear varn(1) case
> (preserve)
(encoding automatically selected: ISO-8859-2)
(18 vars, 777 obs)

. *replace MS = "27827" if MS == "27827-1"
. *destring MS, force replace
. foreach var of varlist DAS cite_data confidential_data forward_slash requirem
> ents include_data macosx matlab_toolboxes readme relative_path save_output st
> ata_packages {
  2.         generate `var'b = 0 if `var' == "false"
  3.         replace `var'b = 1 if `var' == "true"
  4.         drop `var'
  5.         ren `var'b `var'
  6. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 missing value generated)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 missing value generated)
(1 real change made)

. 
. save "`here'/data/issues.dta", replace
file /home/restud/report//data/issues.dta saved

. 
end of do-file
