
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/github.do 

. clear all

. here
/Users/koren/Tresorit/Mac/places/restud/data-editor/report/

. local here = r(here)

. 
. import delimited "`here'github-data/data/raw/gitlog.csv", clear varn(1) case(
> preserve) bindquotes(strict)
(encoding automatically selected: UTF-8)
(7 vars, 3,681 obs)

. replace MS = "27827" if MS == "27827-1"
(24 real changes made)

. destring MS, force replace
MS: contains nonnumeric characters; replaced as long
(3 missing values generated)

. 
. * Julia datetime is in timestamps with seconds (2019-12-10T17:28:33Z)
. replace date = substr(date, 1, 10)
(3,681 real changes made)

. gen numeric_date = date(date, "YMD")

. scalar fy2021 = date("2020-09-01", "YMD")

. scalar fy2022 = fy2021 + 365

. scalar fy2023 = fy2022 + 365

. scalar fy2024 = fy2023 + 365

. * 2024 is a leap year   
. scalar fy2025 = fy2024 + 366

. scalar fy2026 = fy2025 + 365

. 
. * keep only packages with new branch naming
. keep if inlist(branch, "author", "version1", "version2", "version3", "version
> 4")
(317 observations deleted)

. gen byte accepted_tag = tag=="accepted" | tag == "accept"

. * there are some duplicate tags
. egen first_accepted = min(cond(accepted_tag, numeric_date, .)), by(MS)
(365 missing values generated)

. generate byte ever_accepted = !missing(first_accepted)

. 
. * keep packages accepted in 2021 fiscal year
. egen submitted_at = min(numeric_date), by(MS)

. generate accepted_at = first_accepted
(365 missing values generated)

. scalar dbegin = fy2021

. scalar dend = fy2026

. 
. generate submitted_year = .
(3,364 missing values generated)

. generate accepted_year = .
(3,364 missing values generated)

. 
. forvalues fy = 2021/2025 {
  2.         local begindate = fy`fy'
  3.         local enddate = fy`=`fy'+1' -1
  4.     replace submitted_year = `fy' if inrange(submitted_at, `begindate', `e
> nddate') & submitted_year == .
  5.     replace accepted_year = `fy' if inrange(accepted_at, `begindate', `end
> date') & accepted_year == .
  6. }
(563 real changes made)
(288 real changes made)
(739 real changes made)
(740 real changes made)
(555 real changes made)
(566 real changes made)
(803 real changes made)
(773 real changes made)
(681 real changes made)
(632 real changes made)

. 
. egen ms_tag = tag(MS)

. keep if ever_accepted & (accepted_at > dbegin) * (accepted_at <= dend)
(365 observations deleted)

. 
. drop if regexm(message, "Merge tag 'accepted' into")
(2 observations deleted)

. drop if regexm(message, "Merge tag 'accept' into")
(1 observation deleted)

. drop if regexm(message, "Create .zenodo")
(169 observations deleted)

. drop if regexm(message, "Merge pull request #1 from restud-replication-packag
> es/author")
(0 observations deleted)

. drop if regexm(message, "Merge pull request #2 from restud-replication-packag
> es/author")
(0 observations deleted)

. drop if MS == 24478 & accepted_year == 2025 // the authors asked for revision
(0 observations deleted)

. drop if MS == 26586 & accepted_year == 2025 // Nunn that had to be revisited
(6 observations deleted)

. 
. tabulate submitted_year if ms_tag == 1

submitted_y |
        ear |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |         34       10.24       10.24
       2022 |         72       21.69       31.93
       2023 |         77       23.19       55.12
       2024 |         77       23.19       78.31
       2025 |         72       21.69      100.00
------------+-----------------------------------
      Total |        332      100.00

. tabulate accepted_year if ms_tag == 1

accepted_ye |
         ar |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |         24        7.23        7.23
       2022 |         69       20.78       28.01
       2023 |         84       25.30       53.31
       2024 |         72       21.69       75.00
       2025 |         83       25.00      100.00
------------+-----------------------------------
      Total |        332      100.00

. 
. save "`here'data/git-events.dta", replace
file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/data/git-event
    > s.dta saved

. 
. import delimited "`here'github-data/data/temp/issues.csv", clear varn(1) case
> (preserve)
(encoding automatically selected: ISO-8859-2)
(18 vars, 777 obs)

. *replace MS = "27827" if MS == "27827-1"
. *destring MS, force replace
. foreach var of varlist DAS cite_data confidential_data forward_slash requirem
> ents include_data macosx matlab_toolboxes readme relative_path save_output st
> ata_packages {
  2.         generate `var'b = 0 if `var' == "false"
  3.         replace `var'b = 1 if `var' == "true"
  4.         drop `var'
  5.         ren `var'b `var'
  6. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 missing value generated)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 missing value generated)
(1 real change made)

. 
. save "`here'data/issues.dta", replace
file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/data/issues.dt
    > a saved

. 
end of do-file
