
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/github.do 

. clear all

. here
/Users/koren/Tresorit/Mac/places/restud/data-editor/report/

. local here = r(here)

. 
. import delimited "`here'/github-data/output/gitlog.csv", clear varn(1) case(p
> reserve)
(encoding automatically selected: UTF-8)
(7 vars, 2,703 obs)

. replace MS = "27827" if MS == "27827-1"
(20 real changes made)

. destring MS, force replace
MS: contains nonnumeric characters; replaced as long
(3 missing values generated)

. 
. * Julia datetime is in timestamps with seconds (2019-12-10T17:28:33Z), let's 
> use days.
. replace date = substr(date, 1, 10)
(2,703 real changes made)

. gen numeric_date = date(date, "YMD")

. scalar fy2021 = date("2020-09-01", "YMD")

. scalar fy2022 = fy2021 + 365

. scalar fy2023 = fy2022 + 365

. scalar fy2024 = fy2023 + 365

. * 2024 is a leap year   
. scalar fy2025 = fy2024 + 366

. 
. * keep only packages with new branch naming
. keep if inlist(branch, "author", "version1", "version2", "version3", "version
> 4")
(271 observations deleted)

. egen byte ever_accepted = max(tag=="accepted"), by(MS)

. 
. * keep backages accepted in 2021 fiscal year
. egen submitted_at = min(numeric_date), by(MS)

. egen accepted_at = max(cond(tag=="accepted", numeric_date, .)), by(MS)
(571 missing values generated)

. scalar dbegin = fy2021

. * 2024 is a leap year
. scalar dend = fy2024 + 366

. 
. generate submitted_year = .
(2,432 missing values generated)

. generate accepted_year = .
(2,432 missing values generated)

. forvalues fy = 2021/2024 {
  2.         local begindate = fy`fy'
  3.         local enddate = fy`=`fy'+1' - 1
  4.     replace submitted_year = `fy' if inrange(submitted_at, `begindate', `e
> nddate') & submitted_year == .
  5.     replace accepted_year = `fy' if inrange(accepted_at, `begindate', `end
> date') & accepted_year == .
  6. }
(511 real changes made)
(241 real changes made)
(699 real changes made)
(453 real changes made)
(509 real changes made)
(491 real changes made)
(691 real changes made)
(676 real changes made)

. 
. egen ms_tag = tag(MS)

. tabulate submitted_year if ms_tag == 1

submitted_y |
        ear |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |         56       16.87       16.87
       2022 |         87       26.20       43.07
       2023 |         91       27.41       70.48
       2024 |         98       29.52      100.00
------------+-----------------------------------
      Total |        332      100.00

. tabulate accepted_year if ms_tag == 1

accepted_ye |
         ar |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |         29       11.69       11.69
       2022 |         45       18.15       29.84
       2023 |         84       33.87       63.71
       2024 |         90       36.29      100.00
------------+-----------------------------------
      Total |        248      100.00

. 
. keep if ever_accepted & (accepted_at > dbegin) * (accepted_at <= dend)
(571 observations deleted)

. save "`here'/data/git-events.dta", replace
file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report//data/git-even
    > ts.dta saved

. 
. import delimited "`here'github-data/output/report-labs.csv", clear varn(1) ca
> se(preserve)
(encoding automatically selected: ISO-8859-1)
(16 vars, 756 obs)

. replace MS = "27827" if MS == "27827-1"
(2 real changes made)

. destring MS, force replace
MS: all characters numeric; replaced as long

. foreach var of varlist DAS cite_data confidential_data forward_slash hardware
> _requirements include_data macosx matlab_toolboxes merge_readme relative_path
>  save_output software_requirements stata_packages {
  2.         generate `var'b = 0 if `var' == "false"
  3.         replace `var'b = 1 if `var' == "true"
  4.         drop `var'
  5.         ren `var'b `var'
  6. }
(179 missing values generated)
(179 real changes made)
(221 missing values generated)
(221 real changes made)
(22 missing values generated)
(22 real changes made)
(70 missing values generated)
(70 real changes made)
(5 missing values generated)
(5 real changes made)
(10 missing values generated)
(10 real changes made)
(73 missing values generated)
(73 real changes made)
(23 missing values generated)
(23 real changes made)
(1 missing value generated)
(1 real change made)
(66 missing values generated)
(66 real changes made)
(74 missing values generated)
(74 real changes made)
(3 missing values generated)
(3 real changes made)
(61 missing values generated)
(61 real changes made)

. 
. save "`here'/data/issues.dta", replace
file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report//data/issues.d
    > ta saved

. 
end of do-file
