
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 2-user 4-core network, expiring 16 Jan 2026
Serial number: 501909221790
  Licensed to: CodedThinking
               Budapest

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/github.do 

. clear all

. here
/home/restud/report/

. local here = r(here)

. 
. import delimited "`here'github-data/data/raw/gitlog.csv", clear varn(1) case(
> preserve)
(encoding automatically selected: UTF-8)
Note: Unmatched quote while processing row 30; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 32; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 505; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 507; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 520; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 522; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 578; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 580; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 632; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 634; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 658; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 660; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 693; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 695; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 727; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 729; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 872; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 874; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 889; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 891; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1080; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1082; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1265; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1267; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1380; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1382; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1394; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1396; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1432; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1434; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1495; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1497; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1515; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1517; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1539; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1541; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1581; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1583; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1703; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1705; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1782; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1784; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1906; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1908; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1976; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1978; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1985; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1987; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1990; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 1992; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2105; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2107; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2123; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2125; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2133; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2135; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2313; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 2315; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3008; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3010; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3011; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3013; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3018; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3020; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3352; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3362; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3363; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
Note: Unmatched quote while processing row 3379; this can be due to a
    formatting problem in the file or because a quoted data element spans
    multiple lines. You should carefully inspect your data after importing.
    Consider using option bindquote(strict) if quoted data spans multiple
    lines or option bindquote(nobind) if quotes are not used for binding
    data.
(7 vars, 3,732 obs)

. replace MS = "27827" if MS == "27827-1"
(24 real changes made)

. destring MS, force replace
MS: contains nonnumeric characters; replaced as long
(54 missing values generated)

. 
. * Julia datetime is in timestamps with seconds (2019-12-10T17:28:33Z)
. replace date = substr(date, 1, 10)
(3,681 real changes made)

. gen numeric_date = date(date, "YMD")
(51 missing values generated)

. scalar fy2021 = date("2020-09-01", "YMD")

. scalar fy2022 = fy2021 + 365

. scalar fy2023 = fy2022 + 365

. scalar fy2024 = fy2023 + 365

. * 2024 is a leap year   
. scalar fy2025 = fy2024 + 366

. scalar fy2026 = fy2025 + 365

. 
. * keep only packages with new branch naming
. keep if inlist(branch, "author", "version1", "version2", "version3", "version
> 4")
(368 observations deleted)

. egen byte ever_accepted = max(tag=="accepted" | tag == "accept"), by(MS)

. 
. * keep backages accepted in 2021 fiscal year
. egen submitted_at = min(numeric_date), by(MS)

. egen accepted_at = max(cond(tag=="accepted" | tag == "accept", numeric_date, 
> .)), by(MS)
(365 missing values generated)

. scalar dbegin = fy2021

. scalar dend = fy2026

. 
. generate submitted_year = .
(3,364 missing values generated)

. generate accepted_year = .
(3,364 missing values generated)

. 
. forvalues fy = 2021/2025 {
  2.         local begindate = fy`fy'
  3.         local enddate = fy`=`fy'+1' -1
  4.     replace submitted_year = `fy' if inrange(submitted_at, `begindate', `e
> nddate') & submitted_year == .
  5.     replace accepted_year = `fy' if inrange(accepted_at, `begindate', `end
> date') & accepted_year == .
  6. }
(563 real changes made)
(186 real changes made)
(739 real changes made)
(559 real changes made)
(555 real changes made)
(478 real changes made)
(803 real changes made)
(559 real changes made)
(681 real changes made)
(1,217 real changes made)

. 
. egen ms_tag = tag(MS)

. tabulate submitted_year if ms_tag == 1

submitted_y |
        ear |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |         56       12.93       12.93
       2022 |         87       20.09       33.03
       2023 |         91       21.02       54.04
       2024 |         98       22.63       76.67
       2025 |        101       23.33      100.00
------------+-----------------------------------
      Total |        433      100.00

. tabulate accepted_year if ms_tag == 1

accepted_ye |
         ar |      Freq.     Percent        Cum.
------------+-----------------------------------
       2021 |         23        5.97        5.97
       2022 |         68       17.66       23.64
       2023 |         83       21.56       45.19
       2024 |         73       18.96       64.16
       2025 |        138       35.84      100.00
------------+-----------------------------------
      Total |        385      100.00

. 
. keep if ever_accepted & (accepted_at > dbegin) * (accepted_at <= dend)
(365 observations deleted)

. 
. drop if regexm(message, "Merge tag 'accepted' into")
(2 observations deleted)

. drop if regexm(message, "Merge tag 'accept' into")
(1 observation deleted)

. drop if regexm(message, "Create .zenodo")
(144 observations deleted)

. drop if regexm(message, "Merge pull request #1 from restud-replication-packag
> es/author")
(24 observations deleted)

. drop if regexm(message, "Merge pull request #2 from restud-replication-packag
> es/author")
(1 observation deleted)

. drop if MS == 24478 & year == 2025 /// the authors asked for revision
> drop if MS == 26586 & year == 2025 /// Nunn that had to be revisited
> 
year not found
r(111);

end of do-file
r(111);
