
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 2-user 4-core network, expiring 16 Jan 2026
Serial number: 501909221790
  Licensed to: CodedThinking
               Budapest

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/issues.do 

. clear all

. here
/home/restud/report/

. local here = r(here)

. 
. tempfile git

. use "`here'data/git-events.dta", clear

. keep MS

. duplicates drop

Duplicates in terms of all variables

(2,614 observations deleted)

. save `git', replace
(file /tmp/St4134059.000001 not found)
file /tmp/St4134059.000001 saved as .dta format

. 
. use "`here'data/issues.dta", clear

. duplicates drop MS, force

Duplicates in terms of MS

(396 observations deleted)

. merge 1:1 MS using `git', keep(match using) nogenerate

    Result                      Number of obs
    -----------------------------------------
    Not matched                            60
        from master                         0  
        from using                         60  

    Matched                               325  
    -----------------------------------------

. save "`here'temp/issues.dta", replace
file /home/restud/report/temp/issues.dta saved

. 
. drop MS branch commit

. unab vars: _all

. collapse (mean) `vars'
string variable data_manipulation not allowed with statistic mean
r(109);

end of do-file
r(109);
