
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/issues.do 

. clear all

. here
/Users/koren/Tresorit/Mac/places/restud/data-editor/report/

. local here = r(here)

. 
. tempfile git

. use "`here'data/git-events.dta", clear

. keep MS

. duplicates drop

Duplicates in terms of all variables

(1,858 observations deleted)

. save `git', replace
(file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St38892.000001 not
    found)
file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St38892.000001 saved
    as .dta format

. 
. use "`here'data/issues.dta", clear

. duplicates drop MS, force

Duplicates in terms of MS

(0 observations are duplicates)

. merge 1:1 MS using `git', keep(match using) nogenerate

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               290  
    -----------------------------------------

. save "`here'temp/issues.dta", replace
(file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/temp/issues.dt
    > a not found)
file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/temp/issues.dt
    > a saved

. 
. drop MS branch commit

. unab vars: _all

. collapse (mean) `vars'

. 
. rename * V*

. generate i = 1

. reshape long V, i(i) j(issue) string
(j = DAS cite_data confidential_data forward_slash hardware_requirements includ
> e_data macosx matlab_toolboxes merge_readme relative_path save_output softwar
> e_requirements stata_packages)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations                1   ->   13          
Number of variables                  14   ->   3           
j variable (13 values)                    ->   issue
xij variables:
    VDAS Vcite_data ... Vstata_packages   ->   V
-----------------------------------------------------------------------------

. replace V = 100*V
(13 real changes made)

. 
. generate issue_num = 4 if issue=="cite_data"
(12 missing values generated)

. replace issue_num = 3 if issue=="DAS"
(1 real change made)

. replace issue_num = 2 if issue=="save_output"
(1 real change made)

. replace issue_num = 1 if issue=="stata_packages"
(1 real change made)

. 
. label define IV 1 "Stata packages" 2 "Save output" 3 "DAS" 4 "Cite data"

. label values issue_num IV

. 
. local opt graphregion(color(white)) horizontal ylab(#4, value) xtitle(Percent
> ) ytitle("")

. twoway dropline V issue_num, `opt' color(blue)

. graph export "`here'output/main_issues.png", replace width(800)
file /Users/koren/Tresorit/Mac/places/restud/data-editor/report/output/main_iss
> ues.png written in PNG format

. 
end of do-file
