
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 2-user 4-core network, expiring 16 Jan 2026
Serial number: 501909221790
  Licensed to: CodedThinking
               Budapest

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/revisions_time.do 

. use "temp/collapsed_year.dta", clear

. 
. keep if revision == max_revision
(452 observations deleted)

. collapse (count) n = MS, by(year max_revision)

. rename max_revision revision

. reshape wide n, i(year) j(revision)
(j = 0 1 2 3 4)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations               22   ->   5           
Number of variables                   3   ->   6           
j variable (5 values)          revision   ->   (dropped)
xij variables:
                                      n   ->   n0 n1 ... n4
-----------------------------------------------------------------------------

. 
. egen n2plus = rowtotal(n2 n3 n4)

. 
. tsset year

Time variable: year, 2021 to 2025
        Delta: 1 unit

. tsline n0 n1 n2plus, title("Distribution of Package Revisions Over Time") yti
> tle("Number of packages") xtitle("Year") legend(order(1 "0 revisions" 2 "1 re
> vision" 3 "2 or more revisions")) ylab(0(20)100)

. 
. * Export the graph
. graph export "output/revisions_time.png", replace width(1000)
file output/revisions_time.png written in PNG format

. 
end of do-file
