
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/success.do 

. use "temp/zenodo.dta", clear

. merge 1:1 MS using "temp/commands.dta", keep(match master) nogenerate

    Result                      Number of obs
    -----------------------------------------
    Not matched                            70
        from master                        70  
        from using                          0  

    Matched                               159  
    -----------------------------------------

. merge 1:1 MS using "temp/issues.dta", keep(match) nogenerate

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               198  
    -----------------------------------------

. 
. generate byte stata = !missing(n_lines)

. generate ln_n_lines = ln(n_lines)
(60 missing values generated)

. generate ln_n_files = ln(n_files)
(60 missing values generated)

. 
. poisson downloads_per_month stata DAS cite_data, robust
note: noncount dependent variable encountered; if you are fitting an
      exponential-mean model, consider using robust standard errors.

Iteration 0:  Log pseudolikelihood = -658.75405  
Iteration 1:  Log pseudolikelihood = -658.75403  

Poisson regression                                      Number of obs =    198
                                                        Wald chi2(3)  =   8.13
                                                        Prob > chi2   = 0.0434
Log pseudolikelihood = -658.75403                       Pseudo R2     = 0.0432

------------------------------------------------------------------------------
             |               Robust
downloads_~h | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       stata |   .3470319   .1542012     2.25   0.024     .0448031    .6492607
         DAS |  -.2775466   .3373279    -0.82   0.411    -.9386971    .3836039
   cite_data |   .4843082   .3356071     1.44   0.149    -.1734696    1.142086
       _cons |   1.009951   .1167963     8.65   0.000     .7810341    1.238867
------------------------------------------------------------------------------

. 
. poisson downloads_per_month ln_n_files ln_n_lines DAS cite_data if stata, rob
> ust
note: noncount dependent variable encountered; if you are fitting an
      exponential-mean model, consider using robust standard errors.

Iteration 0:  Log pseudolikelihood =   -528.601  
Iteration 1:  Log pseudolikelihood = -528.60099  

Poisson regression                                      Number of obs =    138
                                                        Wald chi2(4)  =   3.74
                                                        Prob > chi2   = 0.4421
Log pseudolikelihood = -528.60099                       Pseudo R2     = 0.0362

------------------------------------------------------------------------------
             |               Robust
downloads_~h | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
  ln_n_files |   .0626726   .1339961     0.47   0.640     -.199955    .3253002
  ln_n_lines |   .0500413    .091344     0.55   0.584    -.1289897    .2290723
         DAS |  -.3429037   .4591813    -0.75   0.455    -1.242883    .5570752
   cite_data |   .4349448   .4773217     0.91   0.362    -.5005885    1.370478
       _cons |   .9168966   .4086853     2.24   0.025     .1158881    1.717905
------------------------------------------------------------------------------

. 
end of do-file
