
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/zenodo.do 

. here
/Users/koren/Tresorit/Mac/places/restud/data-editor/report/

. local here = r(here)

. 
. clear

. import delimited "`here'github-data/output/zenodo2ms.csv", clear varnames(1) 
> case(preserve) encoding(UTF-8)
(2 vars, 674 obs)

. keep MS zenodoid

. duplicates drop zenodoid MS, force

Duplicates in terms of zenodoid MS

(14 observations deleted)

. isid zenodoid MS

. tempfile z2g

. save `z2g', replace
(file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St25895.000001 not
    found)
file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St25895.000001 saved
    as .dta format

. 
. clear 

. tempfile zenodo

. import delimited using "`here'zenodo/zenodo_data_2021.csv", clear
(encoding automatically selected: ISO-8859-1)
(6 vars, 80 obs)

. rename id zenodoid

. keep zenodoid unique_views unique_downloads

. rename unique_* *

. rename downloads downloads2021

. rename views views2021

. save `zenodo', replace
(file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St25895.000002 not
    found)
file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St25895.000002 saved
    as .dta format

. 
. tempfile zenodo22

. import delimited using "`here'zenodo/zenodo_data_2022.csv", clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 133 obs)

. rename id zenodoid

. generate created_at = date(created,"YMD##")

. keep zenodoid unique_views unique_downloads created_at

. rename unique_* *

. rename downloads downloads2022

. rename views views2022

. merge 1:1 zenodoid using `zenodo', nogenerate

    Result                      Number of obs
    -----------------------------------------
    Not matched                            53
        from master                        53  
        from using                          0  

    Matched                                80  
    -----------------------------------------

. save `zenodo22', replace
(file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St25895.000003 not
    found)
file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St25895.000003 saved
    as .dta format

. 
. tempfile zenodo23

. import delimited using "`here'zenodo/zenodo_data.csv", clear
(encoding automatically selected: ISO-8859-1)
(8 vars, 5,597 obs)

. rename id zenodoid

. generate created_at = date(created,"YMD##")

. keep zenodoid unique_views unique_downloads created_at

. keep if created_at < 23260 // fy2023
(759 observations deleted)

. rename unique_* *

. rename downloads downloads2023

. rename views views2023

. duplicates drop zenodoid, force

Duplicates in terms of zenodoid

(4,571 observations deleted)

. merge 1:1 zenodoid using `zenodo22', nogenerate

    Result                      Number of obs
    -----------------------------------------
    Not matched                           136
        from master                       135  
        from using                          1  

    Matched                               132  
    -----------------------------------------

. save `zenodo23', replace
(file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St25895.000004 not
    found)
file /var/folders/3b/07ltjm9n0rq1pwkn1_49vqn40000gn/T//St25895.000004 saved
    as .dta format

. 
. import delimited using "`here'zenodo/zenodo_data.csv", clear
(encoding automatically selected: ISO-8859-1)
(8 vars, 5,597 obs)

. rename id zenodoid

. generate created_at = date(created,"YMD##")

. generate updated_at = date(update_time,"YMD##")

. 
. format created_at %tdCCYY-NN-DD

. format updated_at %tdCCYY-NN-DD

. 
. keep zenodoid unique_views unique_downloads created_at updated_at

. rename unique_* *

. 
. codebook zenodoid

-------------------------------------------------------------------------------
zenodoid                                                            (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [3366100,13308366]            Units: 1
         Unique values: 339                       Missing .: 0/5,597

                  Mean: 6.7e+06
             Std. dev.: 2.0e+06

           Percentiles:     10%       25%       50%       75%       90%
                        4.3e+06   5.1e+06   6.6e+06   7.7e+06   1.0e+07

. 
. sort zenodoid updated_at

. by zenodoid (updated_at): generate update = _n

. xtset zenodoid update

Panel variable: zenodoid (unbalanced)
 Time variable: update, 1 to 20
         Delta: 1 unit

. codebook zenodoid

-------------------------------------------------------------------------------
zenodoid                                                            (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [3366100,13308366]            Units: 1
         Unique values: 339                       Missing .: 0/5,597

                  Mean: 6.7e+06
             Std. dev.: 2.0e+06

           Percentiles:     10%       25%       50%       75%       90%
                        4.3e+06   5.1e+06   6.6e+06   7.7e+06   1.0e+07

. 
. generate spell_length = updated_at - L.updated_at
(339 missing values generated)

. generate new_downloads = downloads - L.downloads
(339 missing values generated)

. generate new_views = views - L.views
(339 missing values generated)

. generate days_since_upload = updated_at - created_at

. generate months_since_upload = int(days_since_upload/30)

. 
. drop if spell_length < 20 | missing(spell_length)
(2,538 observations deleted)

. generate downloads_per_month = new_downloads / (spell_length/30)

. 
. keep if days_since_upload > 180
(226 observations deleted)

. summarize downloads_per_month, detail

                     downloads_per_month
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               2,833
25%     .9677419              0       Sum of wgt.       2,833

50%            2                      Mean           4.043645
                        Largest       Std. dev.      9.399673
75%      4.83871            110
90%     8.709678       113.2258       Variance       88.35385
95%           13        116.129       Skewness       17.71271
99%     29.03226       325.1613       Kurtosis       515.7555

. 
. collapse (mean) downloads_per_month, by(zenodoid)

. codebook zenodoid

-------------------------------------------------------------------------------
zenodoid                                                            (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [3366100,10713971]            Units: 1
         Unique values: 293                       Missing .: 0/293

                  Mean: 6.5e+06
             Std. dev.: 1.7e+06

           Percentiles:     10%       25%       50%       75%       90%
                        4.3e+06   5.1e+06   6.6e+06   7.6e+06   8.3e+06

. 
. summarize downloads_per_month, detail

                 (mean) downloads_per_month
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     .5717463              0
10%     .9813682              0       Obs                 293
25%     1.790323       .2857143       Sum of wgt.         293

50%     2.849648                      Mean           4.076977
                        Largest       Std. dev.       6.29607
75%     4.265728       18.67059
90%     7.281742        18.7979       Variance        39.6405
95%     12.49563       37.84536       Skewness       9.225962
99%      18.7979       88.90968       Kurtosis       116.7881

. histogram downloads_per_month, legend(off) graphregion(color(white)) frequenc
> y xtitle(Downloads per month)
(bin=17, start=0, width=5.2299809)

. graph export "`here'output/downloads_histogram.png", replace width(800)
file /Users/koren/Tresorit/Mac/places/restud/data-editor/report/output/download
> s_histogram.png written in PNG format

. 
. merge 1:m zenodoid using `z2g', keep(match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               230  (_merge==3)
    -----------------------------------------

. 
. collapse (sum) downloads_per_month, by(MS)

. 
. save "`here'temp/zenodo.dta", replace
file
    /Users/koren/Tresorit/Mac/places/restud/data-editor/report/temp/zenodo.dt
    > a saved

. 
. 
end of do-file
