
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: Single-user 2-core  perpetual
Serial number: 501606204617
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do code/zenodo.do 

. here
/Users/koren/Tresorit/places/restud/data-editor/report/

. local here = r(here)

. 
. clear 

. tempfile zenodo

. import delimited using "`here'/zenodo/zenodo_data_2021.csv", clear
(6 vars, 80 obs)

. rename id zenodoid

. keep zenodoid unique_views unique_downloads

. rename unique_* *

. rename downloads downloads2021

. rename views views2021

. save `zenodo', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St23538.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St23538.000001 saved

. 
. import delimited using "`here'/zenodo/zenodo_data_2022.csv", clear
(7 vars, 133 obs)

. rename id zenodoid

. generate created_at = date(created,"YMD##")

. keep zenodoid unique_views unique_downloads created_at

. rename unique_* *

. rename downloads downloads2022

. rename views views2022

. merge 1:1 zenodoid using `zenodo', nogenerate

    Result                           # of obs.
    -----------------------------------------
    not matched                            53
        from master                        53  
        from using                          0  

    matched                                80  
    -----------------------------------------

. 
. reshape long views downloads, i(zenodoid) j(year)
(note: j = 2021 2022)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      133   ->     266
Number of variables                   6   ->       5
j variable (2 values)                     ->   year
xij variables:
                    views2021 views2022   ->   views
            downloads2021 downloads2022   ->   downloads
-----------------------------------------------------------------------------

. generate stats_at = date("2021-09-14","YMD##") if year == 2021
(133 missing values generated)

. replace stats_at = date("2022-09-07","YMD##") if year == 2022
(133 real changes made)

. 
. format created_at %tdCCYY-NN-DD

. format stats_at %tdCCYY-NN-DD

. 
. generate since = round((stats_at - created_at)/30)

. drop if missing(downloads) & year == 2021
(53 observations deleted)

. generate downloads_per_month = downloads / since

. 
. keep zenodo year since downloads downloads_per_month

. reshape wide since downloads downloads_per_month, i(zenodoid) j(year)
(note: j = 2021 2022)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      213   ->     133
Number of variables                   5   ->       7
j variable (2 values)              year   ->   (dropped)
xij variables:
                                  since   ->   since2021 since2022
                              downloads   ->   downloads2021 downloads2022
                    downloads_per_month   ->   downloads_per_month2021 download
> s_per_month2022
-----------------------------------------------------------------------------

. 
. generate str lbl = ""
(133 missing values generated)

. replace lbl = "Geography and Agricultural Productivity" if zenodoid == 525988
> 3
variable lbl was str1 now str39
(1 real change made)

. replace lbl = "Quasi-Experimental Shift-Share Research Designs" if zenodoid =
> = 4619197
variable lbl was str39 now str47
(1 real change made)

. replace lbl = "Identifying Shocks via Time-Varying Volatility" if zenodoid ==
>  4448256
(1 real change made)

. replace lbl = "Skill-Biased Structural Change" if zenodoid == 4773516
(1 real change made)

. replace lbl = "Trade and Domestic Production Networks" if zenodoid == 3997900
(1 real change made)

. replace lbl = "Measuring the Incentive to Collude" if zenodoid == 5104830
(1 real change made)

. 
. scatter downloads_per_month2022 downloads_per_month2021, mcolor(blue%30) lege
> nd(off) graphregion(color(white)) mlabel(lbl) mlabposition(6) xtitle(Last yea
> r) ytitle(This year)

. graph export "`here'/downloads.png", replace width(800)
(file /Users/koren/Tresorit/places/restud/data-editor/report//downloads.png wri
> tten in PNG format)

. 
. histogram downloads_per_month2022, color(blue%30) legend(off) graphregion(col
> or(white)) frequency xtitle(Downloads per month)
(bin=11, start=.2, width=.78601402)

. graph export "`here'/downloads_histogram.png", replace width(800)
(file /Users/koren/Tresorit/places/restud/data-editor/report//downloads_histogr
> am.png written in PNG format)

. 
. reshape long
(note: j = 2021 2022)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      133   ->     266
Number of variables                   8   ->       6
j variable (2 values)                     ->   year
xij variables:
                    since2021 since2022   ->   since
            downloads2021 downloads2022   ->   downloads
downloads_per_month2021 downloads_per_month2022->downloads_per_month
-----------------------------------------------------------------------------

. summarize downloads, detail

                          downloads
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%            5              1       Obs                 213
25%            8              2       Sum of Wgt.         213

50%           18                      Mean           28.28169
                        Largest       Std. Dev.      29.50624
75%           37            140
90%           62            147       Variance       870.6184
95%           90            150       Skewness       2.058541
99%          147            151       Kurtosis        7.70042

. 
. 
end of do-file
