
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501706328764
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do code/zenodo.do 

. here
/Users/koren/Tresorit/places/restud/data-editor/report/

. local here = r(here)

. 
. import delimited using "`here'/zenodo/zenodo_data_2022.csv", clear
(encoding automatically selected: ISO-8859-1)
(6 vars, 133 obs)

. rename id zenodoid

. 
. label variable unique_downloads "Downloads"

. label variable unique_views "Views"

. 
. generate str lbl = ""
(133 missing values generated)

. replace lbl = "Identifying Shocks via Time-Varying Volatility" if zenodoid ==
>  4448256
variable lbl was str1 now str46
(1 real change made)

. replace lbl = "Property Rights, Land Misallocation and Agricultural Efficienc
> y in China" if zenodoid == 4029206
variable lbl was str46 now str72
(1 real change made)

. replace lbl = "Trade and Domestic Production Networks" if zenodoid == 3997900
(1 real change made)

. replace lbl = "The Macroeconomics of Microfinance" if zenodoid == 3959907
(1 real change made)

. replace lbl = "Measuring the Incentive to Collude: The Vitamin Cartels, 1990–
> 1999" if zenodoid == 5104830
(1 real change made)

. replace lbl = "Stochastic Revealed Preferences with Measurement Error" if zen
> odoid == 4007866
(1 real change made)

. 
. foreach X of varlist unique_views unique_downloads {
  2.     summarize `X', detail
  3. }

                            Views
-------------------------------------------------------------
      Percentiles      Smallest
 1%           11              7
 5%           20             11
10%           35             14       Obs                 133
25%           52             17       Sum of wgt.         133

50%           86                      Mean           108.1278
                        Largest       Std. dev.      98.46822
75%          127            296
90%          197            309       Variance       9695.991
95%          276            545       Skewness        3.96975
99%          545            836       Kurtosis       26.45597

                          Downloads
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%            5              2       Obs                 133
25%           11              2       Sum of wgt.         133

50%           26                      Mean            34.7594
                        Largest       Std. dev.      33.21992
75%           48            140
90%           82            147       Variance       1103.563
95%          112            149       Skewness        1.68695
99%          149            151       Kurtosis       5.834653

. 
. scatter unique_downloads unique_views, mcolor(blue%30) legend(off) graphregio
> n(color(white)) mlabel(lbl) mlabposition(6) xscale(range(0 600))

. graph export "`here'/downloads.png", replace width(800)
file /Users/koren/Tresorit/places/restud/data-editor/report//downloads.png writ
> ten in PNG format

. 
end of do-file
