
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: Single-user 2-core  perpetual
Serial number: 501606204617
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do code/zenodo.do 

. here
/Users/koren/Tresorit/places/restud/data-editor/report/

. local here = r(here)

. 
. clear 

. tempfile zenodo

. save `zenodo', emptyok replace
(note: dataset contains 0 observations)
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St11247.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St11247.000001 saved

. forvalues year = 2021/2022 {
  2.     import delimited using "`here'/zenodo/zenodo_data_`year'.csv", clear
  3.     rename id zenodoid
  4.     generate year = `year'
  5.     append using `zenodo'
  6.     save `zenodo', replace
  7. }
(6 vars, 80 obs)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St11247.000001 saved
(6 vars, 133 obs)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St11247.000001 saved

. 
. keep zenodoid year unique_views unique_downloads

. rename unique_* *

. reshape wide views downloads, i(zenodoid) j(year)
(note: j = 2021 2022)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      213   ->     133
Number of variables                   4   ->       5
j variable (2 values)              year   ->   (dropped)
xij variables:
                                  views   ->   views2021 views2022
                              downloads   ->   downloads2021 downloads2022
-----------------------------------------------------------------------------

. 
. * uncumulate cumulated stats
. foreach X in views downloads {
  2.     replace `X'2022 = `X'2022 - `X'2021 if !missing(`X'2021)
  3. }
(80 real changes made)
(80 real changes made)

. 
. generate str lbl = ""
(133 missing values generated)

. replace lbl = "Identifying Shocks via Time-Varying Volatility" if zenodoid ==
>  4448256
variable lbl was str1 now str46
(1 real change made)

. replace lbl = "Property Rights, Land Misallocation and Agricultural Efficienc
> y in China" if zenodoid == 4029206
variable lbl was str46 now str72
(1 real change made)

. replace lbl = "Trade and Domestic Production Networks" if zenodoid == 3997900
(1 real change made)

. replace lbl = "The Macroeconomics of Microfinance" if zenodoid == 3959907
(1 real change made)

. replace lbl = "Measuring the Incentive to Collude: The Vitamin Cartels, 1990â€“
> 1999" if zenodoid == 5104830
(1 real change made)

. replace lbl = "Stochastic Revealed Preferences with Measurement Error" if zen
> odoid == 4007866
(1 real change made)

. 
. scatter downloads2022 downloads2021, mcolor(blue%30) legend(off) graphregion(
> color(white)) mlabel(lbl) mlabposition(6) xtitle(Downloads last year) ytitle(
> Downloads in current year)

. graph export "`here'/downloads.png", replace width(800)
(file /Users/koren/Tresorit/places/restud/data-editor/report//downloads.png wri
> tten in PNG format)

. 
. histogram downloads2022, color(blue%30) legend(off) graphregion(color(white))
>  frequency xtitle(Cumulated downloads)
(bin=11, start=1, width=11.545455)

. graph export "`here'/downloads_histogram.png", replace width(800)
(file /Users/koren/Tresorit/places/restud/data-editor/report//downloads_histogr
> am.png written in PNG format)

. 
. reshape long
(note: j = 2021 2022)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      133   ->     266
Number of variables                   6   ->       5
j variable (2 values)                     ->   year
xij variables:
                    views2021 views2022   ->   views
            downloads2021 downloads2022   ->   downloads
-----------------------------------------------------------------------------

. summarize downloads, detail

                          downloads
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%            4              1       Obs                 213
25%            8              2       Sum of Wgt.         213

50%           15                      Mean           21.70423
                        Largest       Std. Dev.      21.25723
75%           27            100
90%           45            107       Variance       451.8697
95%           63            115       Skewness       2.215364
99%          107            128       Kurtosis       8.984347

. 
. 
end of do-file
