
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 2-user 4-core network, expiring 16 Jan 2026
Serial number: 501909221790
  Licensed to: CodedThinking
               Budapest

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/zenodo.do 

. here
/home/restud/report/

. local here = r(here)

. 
. clear

. import delimited "`here'github-data/data/raw/zenodo2ms.csv", clear varnames(1
> ) case(preserve) encoding(UTF-8)
(2 vars, 789 obs)

. keep MS zenodoid

. duplicates drop zenodoid MS, force

Duplicates in terms of zenodoid MS

(17 observations deleted)

. isid zenodoid MS

. tempfile z2g

. save `z2g', replace
(file /tmp/St4133758.000001 not found)
file /tmp/St4133758.000001 saved as .dta format

. 
. clear 

. tempfile zenodo

. import delimited using "`here'zenodo/zenodo_data_2021.csv", clear
(encoding automatically selected: ISO-8859-1)
(6 vars, 80 obs)

. rename id zenodoid

. keep zenodoid unique_views unique_downloads

. rename unique_* *

. rename downloads downloads2021

. rename views views2021

. save `zenodo', replace
(file /tmp/St4133758.000002 not found)
file /tmp/St4133758.000002 saved as .dta format

. 
. tempfile zenodo22

. import delimited using "`here'zenodo/zenodo_data_2022.csv", clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 133 obs)

. rename id zenodoid

. generate created_at = date(created,"YMD##")

. keep zenodoid unique_views unique_downloads created_at

. rename unique_* *

. rename downloads downloads2022

. rename views views2022

. merge 1:1 zenodoid using `zenodo', nogenerate

    Result                      Number of obs
    -----------------------------------------
    Not matched                            53
        from master                        53  
        from using                          0  

    Matched                                80  
    -----------------------------------------

. save `zenodo22', replace
(file /tmp/St4133758.000003 not found)
file /tmp/St4133758.000003 saved as .dta format

. 
. tempfile zenodo23

. import delimited using "`here'github-data/data/raw/zenodo-data.csv", clear
(encoding automatically selected: UTF-8)
(12 vars, 9,501 obs)

. rename id zenodoid

. generate created_at = date(created,"YMD##")

. keep zenodoid unique_views unique_downloads created_at

. keep if created_at < 23260 // fy2023
(1,780 observations deleted)

. rename unique_* *

. rename downloads downloads2023

. rename views views2023

. duplicates drop zenodoid, force

Duplicates in terms of zenodoid

(7,453 observations deleted)

. merge 1:1 zenodoid using `zenodo22', nogenerate

    Result                      Number of obs
    -----------------------------------------
    Not matched                           135
        from master                       135  
        from using                          0  

    Matched                               133  
    -----------------------------------------

. save `zenodo23', replace
(file /tmp/St4133758.000004 not found)
file /tmp/St4133758.000004 saved as .dta format

. 
. import delimited using "`here'github-data/data/raw/zenodo-data.csv", clear
(encoding automatically selected: UTF-8)
(12 vars, 9,501 obs)

. rename id zenodoid

. generate created_at = date(created,"YMD##")

. generate updated_at = date(update_time,"YMD##")

. 
. format created_at %tdCCYY-NN-DD

. format updated_at %tdCCYY-NN-DD

. 
. keep zenodoid unique_views unique_downloads created_at updated_at

. rename unique_* *

. 
. codebook zenodoid

-------------------------------------------------------------------------------
zenodoid                                                            (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [3366100,16539681]            Units: 1
         Unique values: 419                       Missing .: 0/9,501

                  Mean: 7.0e+06
             Std. dev.: 2.4e+06

           Percentiles:     10%       25%       50%       75%       90%
                        4.3e+06   5.1e+06   6.8e+06   7.9e+06   1.1e+07

. 
. sort zenodoid updated_at

. by zenodoid (updated_at): generate update = _n

. xtset zenodoid update

Panel variable: zenodoid (unbalanced)
 Time variable: update, 1 to 32
         Delta: 1 unit

. codebook zenodoid

-------------------------------------------------------------------------------
zenodoid                                                            (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [3366100,16539681]            Units: 1
         Unique values: 419                       Missing .: 0/9,501

                  Mean: 7.0e+06
             Std. dev.: 2.4e+06

           Percentiles:     10%       25%       50%       75%       90%
                        4.3e+06   5.1e+06   6.8e+06   7.9e+06   1.1e+07

. 
. generate spell_length = updated_at - L.updated_at
(419 missing values generated)

. generate new_downloads = downloads - L.downloads
(419 missing values generated)

. generate new_views = views - L.views
(419 missing values generated)

. generate days_since_upload = updated_at - created_at

. generate months_since_upload = int(days_since_upload/30)

. 
. drop if spell_length < 20 | missing(spell_length)
(2,618 observations deleted)

. generate downloads_per_month = new_downloads / (spell_length/30)

. 
. keep if days_since_upload > 180
(500 observations deleted)

. summarize downloads_per_month, detail

                     downloads_per_month
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               6,383
25%     .9677419              0       Sum of wgt.       6,383

50%            2                      Mean           3.680421
                        Largest       Std. dev.      8.324057
75%     4.054054       125.0526
90%     7.741935       139.0909       Variance       69.28992
95%      11.6129       160.6452       Skewness       15.87632
99%         25.2       325.1613       Kurtosis       438.0714

. 
. collapse (mean) downloads_per_month, by(zenodoid)

. codebook zenodoid

-------------------------------------------------------------------------------
zenodoid                                                            (unlabeled)
-------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [3366100,14792036]            Units: 1
         Unique values: 364                       Missing .: 0/364

                  Mean: 7.6e+06
             Std. dev.: 2.7e+06

           Percentiles:     10%       25%       50%       75%       90%
                        4.4e+06   5.5e+06   7.2e+06   9.2e+06   1.1e+07

. 
. summarize downloads_per_month, detail

                 (mean) downloads_per_month
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1578947              0
 5%     .6621988              0
10%     .8630632       .1052632       Obs                 364
25%     1.507767       .1578947       Sum of wgt.         364

50%     2.587929                      Mean           3.761906
                        Largest       Std. dev.      6.397364
75%     4.044976        23.5915
90%     6.691457       23.80811       Variance       40.92626
95%     10.81808       35.43806       Skewness       11.28636
99%      23.5915       104.0656       Kurtosis       169.4119

. histogram downloads_per_month, legend(off) graphregion(color(white)) frequenc
> y xtitle(Downloads per month)
(bin=19, start=0, width=5.4771383)

. graph export "`here'output/downloads_histogram.png", replace width(800)
file /home/restud/report/output/downloads_histogram.png written in PNG format

. 
. merge 1:m zenodoid using `z2g', keep(match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                               292  (_merge==3)
    -----------------------------------------

. 
. collapse (sum) downloads_per_month, by(MS)

. 
. save "`here'temp/zenodo.dta", replace
file /home/restud/report/temp/zenodo.dta saved

. 
. 
end of do-file
